#+OPTIONS: H:3 num:t toc:t \n:nil @:t ::t |:t ^:{} _:{} -:t f:t *:t <:t todo:t
#+INFOJS_OPT: view:t toc:t ltoc:t mouse:underline buttons:0 path:org-info.js
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="solarized-dark.css" />
#+KEYWORDS: c++ cast types
#+HTML_LINK_HOME: https://pimiento.github.io/
#+HTML_LINK_UP: https://pimiento.github.io/
#+TITLE: C++ named cast

** reinterpret_cast
   This is the least safe of the casting mechanisms, and the one most likely to produce bugs. A reinterpret_cast pretends that an object is just a bit pattern that can be treated (for some dark purpose) as if it were an entirely different type of object. You’ll virtually always need to reinterpret_cast back to the original type (or otherwise treat the variable as its original type) before doing anything else with it.

#+NAME: reinterpret_cast
#+BEGIN_SRC cpp :tangle reinterpret_cast.cpp :exports code :noweb yes :results output :flags -std=c++11
  #include <iostream>
  using std::cout;
  using std::endl;
  <<main_example>>
      <<stroustrup>>
  }
#+END_SRC

  The idea of reinterpret_cast is that when you use it, what you get is so foreign that it cannot be used for the type’s original purpose unless you cast it back. Here, we see the cast back to an X* in the call to print, but of course since you still have the original identifier you can also use that. But the xp is only useful as an int*, which is truly a “reinterpretation” of the original X.
#+NAME: main_example
#+BEGIN_SRC cpp :results none :exports none
  const int sz = 3;

  struct X { int a[sz]; };

  void print(X* x) {
      for (int i = 0; i < sz; ++i)
          cout << (x->a)[i] << ' ';
      cout << endl;
  }

  int main() {
      X x;
      print(&x);
      int* xp = reinterpret_cast<int*>(&x);
      for (int* i = xp; i != xp + sz; ++i)
          *i = 0;
      // Can't use xp as an X* at this point
      // unless you cast it back
      print(reinterpret_cast<X*>(xp));
      // You can also use just original identifier
      print(&x);

      // Stroustrup's example
#+END_SRC

#+NAME: stroustrup
#+BEGIN_SRC cpp :results none :exports none
        char c = 'a';
        //! int* p1 = &c; // Error: no implicit char* to int* conversion
        //! int* p2 = static_cast<int*>(&c); // Error: no implicit char* to int* conversion
        int* p3 = reinterpret_cast<int*>(&c); // OK: on your head be it
#+END_SRC

#+RESULTS: reinterpret_cast
: 4196944 0 4196368
: 0 0 0
: 0 0 0
